PX4/NuttX/arch/arm/src/stm32h7/stm32_fdcan_cdev.c
/****************************************************************************
 * arch/arm/src/stm32h7/stm32_fdcan_cdev.c
 *
 * FDCAN Character Device Driver for STM32H7
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include <debug.h>
#include <errno.h>
#include <assert.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/can/can.h>

#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "stm32.h"
#include "stm32_rcc.h"
#include "stm32_gpio.h"
#include "hardware/stm32_fdcan.h"
#include "stm32_fdcan_cdev.h"

#if defined(CONFIG_CAN) && (defined(CONFIG_STM32H7_CAN1) || \
    defined(CONFIG_STM32H7_CAN2) || defined(CONFIG_STM32H7_CAN3))

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Bit timing ***************************************************************/

#define CAN_BIT_QUANTA (CONFIG_STM32H7_CAN_TSEG1 + CONFIG_STM32H7_CAN_TSEG2 + 1)

/* FDCAN peripheral clock comes from HSE (High Speed External oscillator)
 * This is configured via RCC_D2CCIP1R_FDCANSEL in board.h
 */
#define STM32_FDCANCLK  STM32_HSE_FREQUENCY
#define CLK_FREQ        STM32_FDCANCLK

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct stm32_fdcan_s
{
  uint8_t  port;             /* CAN port number (1, 2, or 3) */
  uint8_t  canrx[2];         /* RX IRQ numbers */
  uint8_t  cantx;            /* TX IRQ number */
  uint32_t base;             /* Base address of FDCAN registers */
  uint32_t baud;             /* Configured baud rate */
  uint32_t rxmsgram_offset;  /* RX message RAM offset */
  uint32_t txmsgram_offset;  /* TX message RAM offset */
};

struct fdcan_bitseg
{
  uint32_t bitrate;
  uint8_t  sjw;
  uint8_t  bs1;
  uint8_t  bs2;
  uint16_t prescaler;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* CAN driver methods */

static void stm32_fdcan_reset(struct can_dev_s *dev);
static int  stm32_fdcan_setup(struct can_dev_s *dev);
static void stm32_fdcan_shutdown(struct can_dev_s *dev);
static void stm32_fdcan_rxint(struct can_dev_s *dev, bool enable);
static void stm32_fdcan_txint(struct can_dev_s *dev, bool enable);
static int  stm32_fdcan_ioctl(struct can_dev_s *dev, int cmd, unsigned long arg);
static int  stm32_fdcan_remoterequest(struct can_dev_s *dev, uint16_t id);
static int  stm32_fdcan_send(struct can_dev_s *dev, struct can_msg_s *msg);
static bool stm32_fdcan_txready(struct can_dev_s *dev);
static bool stm32_fdcan_txempty(struct can_dev_s *dev);

/* Helper functions */

static int fdcan_bittiming(struct fdcan_bitseg *timing);
static void stm32_fdcan_configure_message_ram(struct stm32_fdcan_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct can_ops_s g_fdcan_ops =
{
  .co_reset         = stm32_fdcan_reset,
  .co_setup         = stm32_fdcan_setup,
  .co_shutdown      = stm32_fdcan_shutdown,
  .co_rxint         = stm32_fdcan_rxint,
  .co_txint         = stm32_fdcan_txint,
  .co_ioctl         = stm32_fdcan_ioctl,
  .co_remoterequest = stm32_fdcan_remoterequest,
  .co_send          = stm32_fdcan_send,
  .co_txready       = stm32_fdcan_txready,
  .co_txempty       = stm32_fdcan_txempty,
};

#ifdef CONFIG_STM32H7_CAN1
static struct stm32_fdcan_s g_fdcan1priv =
{
  .port             = 1,
  .canrx            = { STM32_IRQ_FDCAN1_0, STM32_IRQ_FDCAN1_1 },
  .cantx            = STM32_IRQ_FDCAN1_0,
  .base             = STM32_FDCAN1_BASE,
  .baud             = CONFIG_STM32H7_CAN1_BAUD,
  .rxmsgram_offset  = 0,
  .txmsgram_offset  = 0,
};

static struct can_dev_s g_fdcan1dev =
{
  .cd_ops           = &g_fdcan_ops,
  .cd_priv          = &g_fdcan1priv,
};
#endif

#ifdef CONFIG_STM32H7_CAN2
static struct stm32_fdcan_s g_fdcan2priv =
{
  .port             = 2,
  .canrx            = { STM32_IRQ_FDCAN2_0, STM32_IRQ_FDCAN2_1 },
  .cantx            = STM32_IRQ_FDCAN2_0,
  .base             = STM32_FDCAN2_BASE,
  .baud             = CONFIG_STM32H7_CAN2_BAUD,
  .rxmsgram_offset  = 0,
  .txmsgram_offset  = 0,
};

static struct can_dev_s g_fdcan2dev =
{
  .cd_ops           = &g_fdcan_ops,
  .cd_priv          = &g_fdcan2priv,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: fdcan_bittiming
 *
 * Description:
 *   Convert desired bitrate to FDCAN bit segment values
 *   The computed values apply to both data and arbitration phases
 *
 * Input Parameters:
 *   timing - structure to store bit timing
 *
 * Returned Value:
 *   OK on success; >0 on failure.
 *
 ****************************************************************************/

static int fdcan_configure_bittiming(struct stm32_fdcan_s *priv)
{
  /* Implementation ported from PX4's uavcan_drivers/stm32[h7]
   *
   * Ref. "Automatic Baudrate Detection in CANopen Networks", U. Koppe
   *  MicroControl GmbH & Co. KG
   *  CAN in Automation, 2003
   *
   * According to the source, optimal quanta per bit are:
   *   Bitrate        Optimal Maximum
   *   1000 kbps      8       10
   *   500  kbps      16      17
   *   250  kbps      16      17
   *   125  kbps      16      17
   */

  const uint32_t target_bitrate    = priv->baud;
  static const int32_t max_bs1     = 16;
  static const int32_t max_bs2     = 8;
  const uint8_t max_quanta_per_bit = (priv->baud >= 1000000) ? 10 : 17;
  static const int max_sp_location = 900;

