PX4/NuttX/arch/arm/src/stm32h7/stm32_fdcan_cdev.c
  /* Computing (prescaler * BS):
   *   BITRATE = 1 / (PRESCALER * (1 / PCLK) * (1 + BS1 + BS2))
   *   BITRATE = PCLK / (PRESCALER * (1 + BS1 + BS2))
   * let:
   *   BS = 1 + BS1 + BS2
   *     (BS == total number of time quanta per bit)
   *   PRESCALER_BS = PRESCALER * BS
   * ==>
   *   PRESCALER_BS = PCLK / BITRATE
   */

  const uint32_t prescaler_bs = CLK_FREQ / target_bitrate;

  /* Find prescaler value such that the number of quanta per bit is highest */

  uint8_t bs1_bs2_sum = max_quanta_per_bit - 1;

  while ((prescaler_bs % (1 + bs1_bs2_sum)) != 0)
    {
      if (bs1_bs2_sum <= 2)
        {
          canerr("Target bitrate too high - no solution possible.\n");
          return 1; /* No solution */
        }

      bs1_bs2_sum--;
    }

  const uint32_t prescaler = prescaler_bs / (1 + bs1_bs2_sum);

  if ((prescaler < 1U) || (prescaler > 1024U))
    {
      canerr("Target bitrate invalid - bad prescaler.\n");
      return 2; /* No solution */
    }

  /* Now we have a constraint: (BS1 + BS2) == bs1_bs2_sum.
   * We need to find the values so that the sample point is as close as
   * possible to the optimal value.
   *
   *   Solve[(1 + bs1)/(1 + bs1 + bs2) == 7/8, bs2]
   *     (Where 7/8 is 0.875, the recommended sample point location)
   *   {{bs2 -> (1 + bs1)/7}}
   *
   * Hence:
   *   bs2 = (1 + bs1) / 7
   *   bs1 = (7 * bs1_bs2_sum - 1) / 8
   *
   * Sample point location can be computed as follows:
   *   Sample point location = (1 + bs1) / (1 + bs1 + bs2)
   *
   * Since the optimal solution is so close to the maximum, we prepare two
   * solutions, and then pick the best one:
   *   - With rounding to nearest
   *   - With rounding to zero
   */

  /* First attempt with rounding to nearest */

  uint8_t bs1 = (uint8_t)((7 * bs1_bs2_sum - 1) + 4) / 8;
  uint8_t bs2 = (uint8_t)(bs1_bs2_sum - bs1);
  uint16_t sample_point_permill =
    (uint16_t)(1000 * (1 + bs1) / (1 + bs1 + bs2));

  if (sample_point_permill > max_sp_location)
    {
      /* Second attempt with rounding to zero */

      bs1 = (7 * bs1_bs2_sum - 1) / 8;
      bs2 = bs1_bs2_sum - bs1;
    }

  bool valid = (bs1 >= 1) && (bs1 <= max_bs1) && (bs2 >= 1) &&
    (bs2 <= max_bs2);

  /* Final validation
   * Helpful Python:
   * def sample_point_from_btr(x):
   *     assert 0b0011110010000000111111000000000 & x == 0
   *     ts2,ts1,brp = (x>>20)&7, (x>>16)&15, x&511
   *     return (1+ts1+1)/(1+ts1+1+ts2+1)
   */

  if (target_bitrate != (CLK_FREQ / (prescaler * (1 + bs1 + bs2))) || !valid)
    {
      canerr("Target bitrate invalid - solution does not match.\n");
      return 3; /* Solution not found */
    }

  caninfo("[fdcan] CLK_FREQ %u, target_bitrate %lu, prescaler %lu, bs1 %d"
          ", bs2 %d\n", (unsigned int)CLK_FREQ, target_bitrate, prescaler_bs, bs1 - 1,
          bs2 - 1);

  uint8_t fin_bs1 = (uint8_t)(bs1 - 1);
  uint8_t fin_bs2 = (uint8_t)(bs2 - 1);
  uint16_t fin_prescaler = (uint16_t)(prescaler - 1);
  uint8_t fin_sjw = 0; /* Which means one */

  caninfo("FDCAN%d: Calculated timing - SJW=%d BS1=%d BS2=%d Prescaler=%d\n",
          priv->port, fin_sjw, fin_bs1, fin_bs2, fin_prescaler);

  uint32_t regval = (fin_sjw << FDCAN_NBTP_NSJW_SHIFT) |
           (fin_bs1 << FDCAN_NBTP_NTSEG1_SHIFT) |
           (fin_bs2 << FDCAN_NBTP_TSEG2_SHIFT) |
           (fin_prescaler << FDCAN_NBTP_NBRP_SHIFT);

  putreg32(regval, priv->base + STM32_FDCAN_NBTP_OFFSET);

  /* Configure data phase (even though we're not using CAN-FD), not sure if this is needed */
  putreg32(regval, priv->base + STM32_FDCAN_DBTP_OFFSET);

  return 0;
}

/****************************************************************************
 * Name: stm32_fdcan_configure_message_ram
 *
 * Description:
 *   Configure the FDCAN Message RAM layout including filters, FIFOs, and
 *   TX buffers. This must be called while in INIT mode with CCE enabled.
 *
 * Input Parameters:
 *   priv - Pointer to the private FDCAN driver state structure
 *
 ****************************************************************************/

static void stm32_fdcan_configure_message_ram(struct stm32_fdcan_s *priv)
{
  uint32_t regval;
  uint32_t ram_offset;

  /* Configure Message RAM
   *
   * EXACT layout per user specification (all sections in strict order):
   * Section                  Elements    Words/Element   Total Words
   * ----------------------------------------------------------------
   * SIDFC.FLSSA 11-bit filter   0-128        1            0-128
   * XIDFC.FLESA 29-bit filter   0-64         2            0-128
   * RXF0C.F0SA  Rx FIFO 0       0-64        18            0-1152
   * RXF1C.F1SA  Rx FIFO 1       0-64        18            0-1152
   * RXBC.RBSA   Rx buffer       0-64        18            0-1152
   * TXEFC.EFSA  Tx event FIFO   0-32         2            0-64
   * TXBC.TBSA   Tx buffers      0-32        18            0-576
   * TMC.TMSA    Trigger memory  0-64         2            0-128
   *
   * Note: Element sizes depend on RXESC/TXESC configuration
   * For RXESC=0, TXESC=0 (8-byte data): Element = 4 words (16 bytes)
   *
   * Our configuration (fitting in 1280 words per interface):
   * 1. 11-bit filter: 1 element (128 words allocated)
   * 2. 29-bit filter: 0 elements (0 words)
   * 3. RX FIFO 0: 64 elements @ 4 words = 256 words
   * 4. RX FIFO 1: 0 elements (0 words)
   * 5. RX Buffer: 0 elements (0 words)
   * 6. TX Event FIFO: 0 elements (0 words)
   * 7. TX Buffers: 32 elements @ 4 words = 128 words
   * 8. Trigger Memory: 0 elements (0 words)
   * Total: 512 words
   */
  ram_offset = priv->rxmsgram_offset;

  /* 1. SIDFC.FLSSA: 11-bit filter (Standard ID Filter Configuration) */
  regval = (ram_offset << FDCAN_SIDFC_FLSSA_SHIFT) | (1 << FDCAN_SIDFC_LSS_SHIFT);
  putreg32(regval, priv->base + STM32_FDCAN_SIDFC_OFFSET);
  ram_offset += 128;  /* Allocate full 128 words */

  /* 2. XIDFC.FLESA: 29-bit filter (Extended ID Filter Configuration) */
  regval = (ram_offset << FDCAN_XIDFC_FLESA_SHIFT) | (0 << FDCAN_XIDFC_LSE_SHIFT);
  putreg32(regval, priv->base + STM32_FDCAN_XIDFC_OFFSET);
  /* ram_offset += 0; - 0 elements */

  /* 3. RXF0C.F0SA: Rx FIFO 0 (Receive FIFO 0 Configuration) */
  regval = (ram_offset << FDCAN_RXF0C_F0SA_SHIFT) | (64 << FDCAN_RXF0C_F0S_SHIFT);
  putreg32(regval, priv->base + STM32_FDCAN_RXF0C_OFFSET);
  ram_offset += 64 * 4;  /* 64 elements @ 4 words each = 256 words */

  /* 4. RXF1C.F1SA: Rx FIFO 1 (Receive FIFO 1 Configuration) */
  regval = (ram_offset << FDCAN_RXF1C_F1SA_SHIFT) | (0 << FDCAN_RXF1C_F1S_SHIFT);
  putreg32(regval, priv->base + STM32_FDCAN_RXF1C_OFFSET);
  /* ram_offset += 0; - 0 elements */

