PX4/NuttX/arch/arm/src/stm32h7/stm32_fdcan_cdev.c
  /* 5. RXBC.RBSA: Rx Buffer (Receive Buffer Configuration) */
  regval = (ram_offset << FDCAN_RXBC_RBSA_SHIFT);
  putreg32(regval, priv->base + STM32_FDCAN_RXBC_OFFSET);
  /* ram_offset += 0; - 0 elements */

  /* 6. TXEFC.EFSA: Tx Event FIFO (Transmit Event FIFO Configuration) */
  regval = (ram_offset << FDCAN_TXEFC_EFSA_SHIFT) | (0 << FDCAN_TXEFC_EFS_SHIFT);
  putreg32(regval, priv->base + STM32_FDCAN_TXEFC_OFFSET);
  /* ram_offset += 0; - 0 elements */

  /* 7. TXBC.TBSA: Tx Buffers (Transmit Buffer Configuration)
   * TFQS: Number of Tx FIFO/Queue elements
   * Maximum TFQS = 32 (NDTB + TFQS must be <= 32)
   */
  regval = (ram_offset << FDCAN_TXBC_TBSA_SHIFT) | (32 << FDCAN_TXBC_TFQS_SHIFT);
  putreg32(regval, priv->base + STM32_FDCAN_TXBC_OFFSET);
  ram_offset += 32 * 4;  /* 32 elements @ 4 words each = 128 words */

  /* 8. TMC.TMSA: Trigger Memory - Not used in our configuration */
  /* No register configuration needed if not using trigger memory */

  caninfo("FDCAN%d: Message RAM configured, total used: %lu words (of 1280 available)\n",
          (unsigned long)(priv->port), (unsigned long)(ram_offset - priv->rxmsgram_offset));

  /* Configure element sizes for Rx and Tx buffers
   * IMPORTANT: These registers define the data field size
   * Value 0 = 8 bytes (classic CAN)
   */

  /* Rx Element Size: 8-byte data field for both FIFOs and RX Buffer */
  putreg32(0, priv->base + STM32_FDCAN_RXESC_OFFSET);  /* 0 = 8 bytes */

  /* Tx Element Size: 8-byte data field */
  putreg32(0, priv->base + STM32_FDCAN_TXESC_OFFSET);  /* 0 = 8 bytes */

  caninfo("FDCAN%d: Element sizes configured (RXESC=0, TXESC=0)\n", priv->port);
}

/****************************************************************************
 * Name: stm32_fdcan_configure_message_ram
 *
 * Description:
 *   Configure the FDCAN filters (currently set to accept all messages into)
 *

 ****************************************************************************/

static void stm32_fdcan_configure_filters(struct stm32_fdcan_s *priv)
{
  /* Configure ONE accept-all filter
   * Filter format: [31:30]=SFEC, [29:16]=SFID1, [15:0]=SFID2
   * SFEC=1: Store in RX FIFO 0 if filter matches
   */
  uint32_t *filter_ram = (uint32_t *)(STM32_CANRAM_BASE + (priv->rxmsgram_offset * 4));
  filter_ram[0] = (1 << 30) | (0x7FF << 16) | 0x000;  /* Accept all to FIFO 0 */

  /* Configure global filter to accept all messages into FIFO 0*/
  uint32_t regval;
  regval = (0 << FDCAN_GFC_ANFS_SHIFT) | (0 << FDCAN_GFC_ANFE_SHIFT);
  putreg32(regval, priv->base + STM32_FDCAN_GFC_OFFSET);
  caninfo("FDCAN%d: Global filter: accept all to FIFO 0 (GFC=0x%08lX)\n", priv->port, regval);
}

/****************************************************************************
 * Name: stm32_fdcan_dump_registers
 *
 * Description:
 *   Dump all relevant FDCAN registers for debugging
 *
 ****************************************************************************/

static void stm32_fdcan_dump_registers(struct stm32_fdcan_s *priv, const char *context)
{
  printf("\n=== FDCAN%d Register Dump: %s ===\n", priv->port, context);

  /* RCC Clock */
  uint32_t rcc = getreg32(STM32_RCC_APB1HENR);
  printf("RCC_APB1HENR: 0x%08lx (FDCANEN=%d)\n", rcc, !!(rcc & RCC_APB1HENR_FDCANEN));

  /* Control registers */
  uint32_t cccr = getreg32(priv->base + STM32_FDCAN_CCCR_OFFSET);
  uint32_t test = getreg32(priv->base + STM32_FDCAN_TEST_OFFSET);
  uint32_t nbtp = getreg32(priv->base + STM32_FDCAN_NBTP_OFFSET);
  uint32_t dbtp = getreg32(priv->base + STM32_FDCAN_DBTP_OFFSET);

  printf("Control Registers:\n");
  printf("CCCR: 0x%08lx (INIT=%d CCE=%d TEST=%d MON=%d FDOE=%d)\n",
         cccr, !!(cccr & FDCAN_CCCR_INIT), !!(cccr & FDCAN_CCCR_CCE),
         !!(cccr & FDCAN_CCCR_TEST), !!(cccr & FDCAN_CCCR_MON),
         !!(cccr & FDCAN_CCCR_FDOE));
  printf("TEST: 0x%08lx (LBCK=%d TX=%lu RX=%d)\n",
         test, !!(test & FDCAN_TEST_LBCK), (test >> 5) & 0x3, !!(test & (1<<7)));
  printf("NBTP: 0x%08lx\n", nbtp);
  printf("DBTP: 0x%08lx\n", dbtp);

  /* Status registers */
  uint32_t psr = getreg32(priv->base + STM32_FDCAN_PSR_OFFSET);
  uint32_t ecr = getreg32(priv->base + STM32_FDCAN_ECR_OFFSET);
  uint32_t ir = getreg32(priv->base + STM32_FDCAN_IR_OFFSET);
  uint32_t ie = getreg32(priv->base + STM32_FDCAN_IE_OFFSET);
  uint32_t ils = getreg32(priv->base + STM32_FDCAN_ILS_OFFSET);
  uint32_t ile = getreg32(priv->base + STM32_FDCAN_ILE_OFFSET);

  printf("Status Registers:\n");
  printf("PSR:  0x%08lx (LEC=%lu ACT=%lu)\n", psr, psr & 0x7, (psr >> 3) & 0x3);
  printf("ECR:  0x%08lx (TEC=%lu REC=%lu)\n", ecr, (ecr >> 0) & 0xFF, (ecr >> 8) & 0x7F);
  printf("IR:   0x%08lx (TC=%d RF0N=%d RF0L=%d PEA=%d)\n",
         ir, !!(ir & (1<<9)), !!(ir & (1<<19)), !!(ir & (1<<21)), !!(ir & (1<<27)));
  printf("IE:   0x%08lx\n", ie);
  printf("ILS:  0x%08lx\n", ils);
  printf("ILE:  0x%08lx (EINT0=%d EINT1=%d)\n",
         ile, !!(ile & FDCAN_ILE_EINT0), !!(ile & FDCAN_ILE_EINT1));

  /* Filter configuration */
  uint32_t gfc = getreg32(priv->base + STM32_FDCAN_GFC_OFFSET);
  uint32_t sidfc = getreg32(priv->base + STM32_FDCAN_SIDFC_OFFSET);
  uint32_t xidfc = getreg32(priv->base + STM32_FDCAN_XIDFC_OFFSET);

  printf("Filter Configuration:\n");
  printf("GFC:   0x%08lx (ANFS=%lu ANFE=%lu)\n", gfc, (gfc >> 4) & 0x3, (gfc >> 2) & 0x3);
  printf("SIDFC: 0x%08lx (LSS=%lu)\n", sidfc, (sidfc >> 16) & 0xFF);
  printf("XIDFC: 0x%08lx\n", xidfc);

  /* RX configuration and status */
  uint32_t rxesc = getreg32(priv->base + STM32_FDCAN_RXESC_OFFSET);
  uint32_t rxf0c = getreg32(priv->base + STM32_FDCAN_RXF0C_OFFSET);
  uint32_t rxf0s = getreg32(priv->base + STM32_FDCAN_RXF0S_OFFSET);
  uint32_t rxf1c = getreg32(priv->base + STM32_FDCAN_RXF1C_OFFSET);
  uint32_t rxf1s = getreg32(priv->base + STM32_FDCAN_RXF1S_OFFSET);

  printf("RX Configuration and Status:\n");
  printf("RXESC: 0x%08lx\n", rxesc);
  printf("RXF0C: 0x%08lx (size=%lu)\n", rxf0c, (rxf0c >> 16) & 0x7F);
  printf("RXF0S: 0x%08lx (fill=%lu get=%lu put=%lu full=%d lost=%d)\n",
         rxf0s, rxf0s & 0x7F, (rxf0s >> 8) & 0x3F, (rxf0s >> 16) & 0x3F,
         !!(rxf0s & (1<<24)), !!(rxf0s & (1<<25)));
  printf("RXF1C: 0x%08lx\n", rxf1c);
  printf("RXF1S: 0x%08lx (fill=%lu)\n", rxf1s, rxf1s & 0x7F);

  /* TX configuration and status */
  uint32_t txesc = getreg32(priv->base + STM32_FDCAN_TXESC_OFFSET);
  uint32_t txbc = getreg32(priv->base + STM32_FDCAN_TXBC_OFFSET);
  uint32_t txfqs = getreg32(priv->base + STM32_FDCAN_TXFQS_OFFSET);
  uint32_t txbrp = getreg32(priv->base + STM32_FDCAN_TXBRP_OFFSET);
  uint32_t txbar = getreg32(priv->base + STM32_FDCAN_TXBAR_OFFSET);
  uint32_t txbto = getreg32(priv->base + STM32_FDCAN_TXBTO_OFFSET);

  printf("TX Configuration and Status:\n");
  printf("TXESC: 0x%08lx\n", txesc);
  printf("TXBC:  0x%08lx (size=%lu)\n", txbc, (txbc >> 24) & 0x3F);
  printf("TXFQS: 0x%08lx (free=%lu get=%lu put=%lu full=%d)\n",
         txfqs, txfqs & 0x3F, (txfqs >> 8) & 0x1F, (txfqs >> 16) & 0x1F,
         !!(txfqs & (1<<21)));
  printf("TXBRP: 0x%08lx (pending)\n", txbrp);
  printf("TXBAR: 0x%08lx (add request)\n", txbar);
  printf("TXBTO: 0x%08lx (transmitted)\n", txbto);

  printf("=== End Register Dump ===\n\n");
}

/****************************************************************************
 * Name: stm32_fdcan_interrupt
 *
 * Description:
 *   Common FDCAN interrupt handler
 *
 ****************************************************************************/

static int stm32_fdcan_interrupt(int irq, void *context, void *arg)
{
  struct can_dev_s *dev = (struct can_dev_s *)arg;
  struct stm32_fdcan_s *priv = (struct stm32_fdcan_s *)dev->cd_priv;
  uint32_t ir;
  uint32_t rxf0s;
  uint32_t get_index;
  uint32_t fill_level;
  struct can_msg_s msg;
  uint32_t *buffer;

  static uint32_t isr_count = 0;
  isr_count++;
  if ((isr_count % 100) == 0)
    {
      printf("FDCAN%d: ISR called %lu times\n", priv->port, isr_count);
    }

