PX4/NuttX/arch/arm/src/stm32h7/stm32_fdcan_cdev.c
  /* Read interrupt status */
  ir = getreg32(priv->base + STM32_FDCAN_IR_OFFSET);

  if (ir == 0)
    {
      /* No interrupt flags set - spurious interrupt? */
      return OK;
    }

  /* Log any interrupt */
  if (ir != 0 && (isr_count % 10) == 0)
    {
      printf("FDCAN%d: IR=0x%08lX\n", priv->port, ir);
    }

  /* Handle RX FIFO 0 new message */
  if (ir & FDCAN_IR_RF0N)
    {
      /* Read RX FIFO 0 status */
      rxf0s = getreg32(priv->base + STM32_FDCAN_RXF0S_OFFSET);
      fill_level = (rxf0s >> 0) & 0x7F;  /* F0FL: Fill level */
      get_index = (rxf0s >> 8) & 0x3F;   /* F0GI: Get index */

      caninfo("FDCAN%d: RX interrupt, fill_level=%lu, get_index=%lu\n",
              priv->port, fill_level, get_index);

      if (fill_level > 0)
        {
          /* Calculate address of RX buffer element
           * RX FIFO 0 is at: base + rxmsgram_offset + 128 (filters) + get_index * 16
           */
          buffer = (uint32_t *)(STM32_CANRAM_BASE +
                                (priv->rxmsgram_offset + 128) * 4 +
                                get_index * 16);  /* 16 bytes per element */

          /* DEBUG: Dump entire RX element (4 words = 16 bytes) */
          printf("FDCAN%d: RX Element @ 0x%08lX (get_index=%lu, rxmsgram_offset=%lu):\n",
                 priv->port, (uint32_t)buffer, get_index, (unsigned long)priv->rxmsgram_offset);
          printf("  buffer[0] (R0): 0x%08lX\n", buffer[0]);
          printf("  buffer[1] (R1): 0x%08lX\n", buffer[1]);
          printf("  buffer[2] (R2): 0x%08lX\n", buffer[2]);
          printf("  buffer[3] (R3): 0x%08lX\n", buffer[3]);

          /* Read message from RX FIFO 0 */
          uint32_t word0 = buffer[0];
          uint32_t word1 = buffer[1];

          /* Parse header - RX element format is different from TX!
           * R0: [29]=XTD, [28:18]=ID (standard), [17:16]=RTR
           * R1: [30:24]=DLC, [20:16]=filter index
           */
          if (word0 & (1 << 29))  /* XTD bit - extended ID */
            {
              msg.cm_hdr.ch_id = (word0 & 0x1FFFFFFF);
              msg.cm_hdr.ch_extid = true;
            }
          else  /* Standard ID */
            {
              msg.cm_hdr.ch_id = (word0 >> 18) & 0x7FF;
              msg.cm_hdr.ch_extid = false;
            }

          msg.cm_hdr.ch_rtr = !!(word0 & (1 << 20));  /* RTR bit in R0[20] */
          msg.cm_hdr.ch_dlc = (word1 >> 24) & 0x7F;   /* DLC field in R1[30:24] - 7 bits! */

          /* For classic CAN, DLC > 8 should be treated as 8 */
          if (msg.cm_hdr.ch_dlc > 8)
            {
              msg.cm_hdr.ch_dlc = 8;
            }

          /* Calculate actual data length from DLC */
          uint8_t len = msg.cm_hdr.ch_dlc;

          /* Read data bytes from buffer[2] and buffer[3] (R2 and R3) */
          for (int i = 0; i < len; i++)
            {
              if (i < 4)
                msg.cm_data[i] = (buffer[2] >> (i * 8)) & 0xFF;
              else
                msg.cm_data[i] = (buffer[3] >> ((i - 4) * 8)) & 0xFF;
            }

          /* Acknowledge message by writing get index to RXF0A */
          putreg32(get_index, priv->base + STM32_FDCAN_RXF0A_OFFSET);

          printf("FDCAN%d: RX ID=0x%03lX DLC=%d Data: %02X %02X %02X %02X %02X %02X %02X %02X (word0=0x%08lX word1=0x%08lX)\n",
                 priv->port, (unsigned long)msg.cm_hdr.ch_id, msg.cm_hdr.ch_dlc,
                 msg.cm_data[0], msg.cm_data[1], msg.cm_data[2], msg.cm_data[3],
                 msg.cm_data[4], msg.cm_data[5], msg.cm_data[6], msg.cm_data[7],
                 word0, word1);

          /* Pass message to upper layer - commented out as no readers registered */
          can_receive(dev, &msg.cm_hdr, msg.cm_data);
        }

      /* Clear interrupt flag */
      putreg32(FDCAN_IR_RF0N, priv->base + STM32_FDCAN_IR_OFFSET);
    }

  /* Handle RX FIFO 0 full */
  if (ir & FDCAN_IR_RF0F)
    {
      canwarn("FDCAN%d: RX FIFO 0 full\n", priv->port);
      putreg32(FDCAN_IR_RF0F, priv->base + STM32_FDCAN_IR_OFFSET);
    }

  /* Handle RX FIFO 0 message lost */
  if (ir & FDCAN_IR_RF0L)
    {
      canerr("FDCAN%d: RX FIFO 0 message lost\n", priv->port);
      putreg32(FDCAN_IR_RF0L, priv->base + STM32_FDCAN_IR_OFFSET);
    }

  /* Handle TX complete */
  if (ir & FDCAN_IR_TC)
    {
      caninfo("FDCAN%d: TX complete\n", priv->port);

      /* Notify upper layer that TX is complete */
      can_txdone(dev);

      /* Clear interrupt flag */
      putreg32(FDCAN_IR_TC, priv->base + STM32_FDCAN_IR_OFFSET);
    }

  return OK;
}


/****************************************************************************
 * Name: stm32_fdcan_reset
 *
 * Description:
 *   Reset the FDCAN device.  Called early to initialize the hardware.
 *
 ****************************************************************************/

static void stm32_fdcan_reset(struct can_dev_s *dev)
{
  struct stm32_fdcan_s *priv = (struct stm32_fdcan_s *)dev->cd_priv;
  irqstate_t flags;

  caninfo("FDCAN%d: Reset\n", priv->port);

  flags = enter_critical_section();

  /* Enter initialization mode */
  modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, 0, FDCAN_CCCR_INIT);

  /* Wait for init mode */
  int timeout = 1000;
  while (!(getreg32(priv->base + STM32_FDCAN_CCCR_OFFSET) & FDCAN_CCCR_INIT) && timeout-- > 0)
    {
      up_udelay(10);
    }

  /* Disable all interrupts */
  putreg32(0, priv->base + STM32_FDCAN_IE_OFFSET);

  /* Clear all interrupt flags (bits 0-29) */
  putreg32(0x3FFFFFFF, priv->base + STM32_FDCAN_IR_OFFSET);

  leave_critical_section(flags);

  caninfo("FDCAN%d: Reset complete\n", priv->port);
}

/****************************************************************************
 * Name: stm32_fdcan_setup
 *
 * Description:
 *   Configure the FDCAN. This method is called the first time that the CAN
 *   device is opened.
 *
 ****************************************************************************/

static int stm32_fdcan_setup(struct can_dev_s *dev)
{
	// CHECK STM32H7 reference manual RM0433, page 2433 for explanation of steps
	// Values and offsets are defined in /hardware/stm32_fdcan.h
	// modifyreg32, getreg32, putreg32 are defined in arm_internal.h
  struct stm32_fdcan_s *priv = (struct stm32_fdcan_s *)dev->cd_priv;
  uint32_t regval;
  uint32_t ram_offset;
  irqstate_t flags;
  int ret;

  flags = enter_critical_section();

  /* Step 0: Enable FDCAN peripheral clock and configure GPIO pins */
#ifdef CONFIG_STM32H7_CAN1
  if (priv->port == 1)
    {
      /* Enable FDCAN1 clock */
      modifyreg32(STM32_RCC_APB1HENR, 0, RCC_APB1HENR_FDCANEN);
      /* Configure GPIO pins for FDCAN1 */
      stm32_configgpio(GPIO_CAN1_RX);
      stm32_configgpio(GPIO_CAN1_TX);
    }
#endif

#ifdef CONFIG_STM32H7_CAN2
  if (priv->port == 2)
    {
      /* Enable FDCAN2 clock (same as FDCAN1, shared peripheral) */
      modifyreg32(STM32_RCC_APB1HENR, 0, RCC_APB1HENR_FDCANEN);
      /* Configure GPIO pins for FDCAN2 */
      stm32_configgpio(GPIO_CAN2_RX);
      stm32_configgpio(GPIO_CAN2_TX);
    }
#endif

  /* Step 1: Exit Power-down / Sleep mode */
  modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, FDCAN_CCCR_CSR, 0);

  /* Step 2: Enter Initialization mode */
  modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, 0, FDCAN_CCCR_INIT);

