PX4/NuttX/arch/arm/src/stm32h7/stm32_fdcan_cdev.c
  /* Wait for INIT mode acknowledgment */
  int timeout = 1000;
  while (!(getreg32(priv->base + STM32_FDCAN_CCCR_OFFSET) & FDCAN_CCCR_INIT) && timeout-- > 0)
    {
      up_udelay(10);
    }

  if (timeout <= 0)
    {
      canerr("ERROR: Failed to enter INIT mode\n");
      leave_critical_section(flags);
      return -ETIMEDOUT;
    }

  /* Step 3: Enable Configuration Change */
  modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, 0, FDCAN_CCCR_CCE);

  /* Step 4: Disable interrupts during configuration */
  putreg32(0, priv->base + STM32_FDCAN_IE_OFFSET);

  /* Step 5: Configure bit timing */
  ret = fdcan_configure_bittiming(priv);
  if (ret != 0)
    {
      canerr("ERROR: Failed to calculate bit timing for baud rate %lu\n", priv->baud);
      leave_critical_section(flags);
      return -EINVAL;
    }

  /* Step 6: Disable CAN-FD mode (classic CAN only) */
  modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, FDCAN_CCCR_FDOE | FDCAN_CCCR_BRSE, 0);

  /* Step 7: Configure Message RAM layout */
  stm32_fdcan_configure_message_ram(priv);

  /* Step 8: Configure filters */
  stm32_fdcan_configure_filters(priv);

  /* Step 9: Clear all interrupt flags (bits 0-29) */
  putreg32(0x3FFFFFFF, priv->base + STM32_FDCAN_IR_OFFSET);

  /* Step 10: Configure interrupt line routing - route all to line 0 */
  putreg32(0, priv->base + STM32_FDCAN_ILS_OFFSET);  /* All interrupts to line 0 */

  /* Step 11: Enable interrupt lines */
  putreg32(FDCAN_ILE_EINT0 | FDCAN_ILE_EINT1, priv->base + STM32_FDCAN_ILE_OFFSET);

  /* Step 12: Enable basic interrupts */
  regval = FDCAN_IE_TCE | FDCAN_IE_RF0NE | FDCAN_IE_RF0FE;
  putreg32(regval, priv->base + STM32_FDCAN_IE_OFFSET);

  /* Step 13: Exit Configuration mode and start operation */
  modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, FDCAN_CCCR_CCE, 0);

  /* Step 13: Exit Initialization mode */
  modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, FDCAN_CCCR_INIT, 0);

  /* Wait for normal operation */
  timeout = 1000;
  while ((getreg32(priv->base + STM32_FDCAN_CCCR_OFFSET) & FDCAN_CCCR_INIT) && timeout-- > 0)
    {
      up_udelay(10);
    }

  if (timeout <= 0)
    {
      canerr("ERROR: Failed to exit INIT mode\n");
      leave_critical_section(flags);
      return -ETIMEDOUT;
    }

  leave_critical_section(flags);

  /* Attach FDCAN interrupt handlers */

  ret = irq_attach(priv->canrx[0], stm32_fdcan_interrupt, dev);
  if (ret < 0)
    {
      canerr("ERROR: Failed to attach FDCAN%d RX0 IRQ\n", priv->port);
      return ret;
    }

  ret = irq_attach(priv->canrx[1], stm32_fdcan_interrupt, dev);
  if (ret < 0)
    {
      canerr("ERROR: Failed to attach FDCAN%d RX1 IRQ\n", priv->port);
      irq_detach(priv->canrx[0]);
      return ret;
    }

  /* Enable the interrupts at the NVIC */
  up_enable_irq(priv->canrx[0]);
  up_enable_irq(priv->canrx[1]);

  caninfo("FDCAN%d: Setup complete\n", priv->port);

  //stm32_fdcan_dump_registers(priv, "Post-Setup");

  //stm32_fdcan_loopback(1, true);
  return OK;
}

/****************************************************************************
 * Name: stm32_fdcan_shutdown
 *
 * Description:
 *   Disable the FDCAN.  This method is called when the CAN device is closed.
 *
 ****************************************************************************/

static void stm32_fdcan_shutdown(struct can_dev_s *dev)
{
	printf("========== stm32_fdcan_shutdown called ==========\n");
  struct stm32_fdcan_s *priv = (struct stm32_fdcan_s *)dev->cd_priv;
  irqstate_t flags;

  caninfo("FDCAN%d: Shutdown\n", priv->port);

  flags = enter_critical_section();

  /* Disable all interrupts */
  putreg32(0, priv->base + STM32_FDCAN_IE_OFFSET);

  /* Clear all interrupt flags (bits 0-29) */
  putreg32(0x3FFFFFFF, priv->base + STM32_FDCAN_IR_OFFSET);

  /* Disable interrupts at the NVIC */
  up_disable_irq(priv->canrx[0]);
  up_disable_irq(priv->canrx[1]);

  /* Detach interrupt handlers */
  irq_detach(priv->canrx[0]);
  irq_detach(priv->canrx[1]);

  /* Enter initialization mode to stop operation */
  modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, 0, FDCAN_CCCR_INIT);

  /* Enter sleep mode to reduce power consumption */
  modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, 0, FDCAN_CCCR_CSR);

  leave_critical_section(flags);

  caninfo("FDCAN%d: Shutdown complete\n", priv->port);
}

/****************************************************************************
 * Name: stm32_fdcan_rxint
 *
 * Description:
 *   Call to enable or disable RX interrupts.
 *
 ****************************************************************************/

static void stm32_fdcan_rxint(struct can_dev_s *dev, bool enable)
{
  struct stm32_fdcan_s *priv = (struct stm32_fdcan_s *)dev->cd_priv;
  uint32_t regval;

  caninfo("FDCAN%d: RX interrupt %s\n", priv->port, enable ? "enable" : "disable");

  if (enable)
    {
      /* Enable RX FIFO 0 interrupts:
       * - RF0NE: New message in FIFO 0
       * - RF0FE: FIFO 0 full
       * - RF0LE: FIFO 0 message lost
       */
      regval = getreg32(priv->base + STM32_FDCAN_IE_OFFSET);
      regval |= (FDCAN_IE_RF0NE | FDCAN_IE_RF0FE | FDCAN_IE_RF0LE);
      putreg32(regval, priv->base + STM32_FDCAN_IE_OFFSET);
    }
  else
    {
      /* Disable RX FIFO 0 interrupts */
      regval = getreg32(priv->base + STM32_FDCAN_IE_OFFSET);
      regval &= ~(FDCAN_IE_RF0NE | FDCAN_IE_RF0FE | FDCAN_IE_RF0LE);
      putreg32(regval, priv->base + STM32_FDCAN_IE_OFFSET);
    }
}

/****************************************************************************
 * Name: stm32_fdcan_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts.
 *
 ****************************************************************************/

static void stm32_fdcan_txint(struct can_dev_s *dev, bool enable)
{
  struct stm32_fdcan_s *priv = (struct stm32_fdcan_s *)dev->cd_priv;
  uint32_t regval;

  caninfo("FDCAN%d: TX interrupt %s\n", priv->port, enable ? "enable" : "disable");

  if (enable)
    {
      /* Enable TX complete interrupt */
      regval = getreg32(priv->base + STM32_FDCAN_IE_OFFSET);
      regval |= FDCAN_IE_TCE;
      putreg32(regval, priv->base + STM32_FDCAN_IE_OFFSET);
    }
  else
    {
      /* Disable TX complete interrupt */
      regval = getreg32(priv->base + STM32_FDCAN_IE_OFFSET);
      regval &= ~FDCAN_IE_TCE;
      putreg32(regval, priv->base + STM32_FDCAN_IE_OFFSET);
    }
}

/****************************************************************************
 * Name: stm32_fdcan_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int stm32_fdcan_ioctl(struct can_dev_s *dev, int cmd, unsigned long arg)
{
  caninfo("FDCAN ioctl cmd=%d - TODO\n", cmd);
  /* TODO: */
  return -ENOTTY;
}

/****************************************************************************
 * Name: stm32_fdcan_remoterequest
 *
 * Description:
 *   Send a remote request
 *
 ****************************************************************************/

static int stm32_fdcan_remoterequest(struct can_dev_s *dev, uint16_t id)
{
  caninfo("FDCAN remote request id=%d - TODO\n", id);
  /* TODO: */
  return -ENOSYS;
}

/****************************************************************************
 * Name: stm32_fdcan_send
 *
 * Description:
 *   Send one CAN message.
 *
 ****************************************************************************/

static int stm32_fdcan_send(struct can_dev_s *dev, struct can_msg_s *msg)
{
	//printf("stm32_fdcan_send called\n");
  struct stm32_fdcan_s *priv = (struct stm32_fdcan_s *)dev->cd_priv;

