PX4/NuttX/arch/arm/src/stm32h7/stm32_fdcan_cdev.c
  //stm32_fdcan_dump_registers(priv, "Before Send");

  /* Check if TX FIFO has space */
  uint32_t txfqs;
  txfqs = getreg32(priv->base + STM32_FDCAN_TXFQS_OFFSET);

  if ((txfqs & FDCAN_TXFQS_TFQF) != 0)
    {
      /* TX FIFO is full */
      canerr("ERROR: TX FIFO full\n");
      return -EBUSY;
    }

  if (((txfqs >> 0) & 0x3F) == 0)
    {
      canerr("ERROR: TX FIFO free level is 0! TXBC=0x%08lx\n",
             getreg32(priv->base + STM32_FDCAN_TXBC_OFFSET));
      return -EBUSY;
    }

  /* Get the put index (where to write next message) */
  uint32_t put_index;
  put_index = (txfqs & FDCAN_TXFQS_TFQPI_MASK) >> FDCAN_TXFQS_TFQPI_SHIFT;

  irqstate_t flags;
  flags = enter_critical_section();

  /* Calculate TX buffer address in message RAM
   * Base address + port offset + buffer offset + (put_index * element_size)
   * Element size = 4 words (16 bytes) for classic CAN with 8-byte data
   */
  uint32_t *tx_buffer;
  tx_buffer = (uint32_t *)(STM32_CANRAM_BASE +
                          (priv->txmsgram_offset * 4) +
                          (put_index * 16));

  /* Build word 0: ID and control bits
   * Bits [31:18]: Standard ID (11 bits) for standard frames
   * Bits [31:0]: Extended ID (29 bits) for extended frames
   * Bit [30]: RTR (Remote Transmission Request)
   * Bit [29]: XTD (Extended ID)
   * Bits [19:16]: DLC (Data Length Code)
   */
  uint32_t word0;
  uint32_t word1;
  if (msg->cm_hdr.ch_extid)
    {
      /* Extended ID (29 bits) */
      word0 = (msg->cm_hdr.ch_id & 0x1FFFFFFF);
      word0 |= (1 << 30);  /* Set XTD bit */
    }
  else
    {
      /* Standard ID (11 bits) in bits [28:18] */
      word0 = ((msg->cm_hdr.ch_id & 0x7FF) << 18);
    }

  if (msg->cm_hdr.ch_rtr)
    {
      word0 |= (1 << 29);  /* Set RTR bit */
    }

  /* Add DLC in bits [19:16] */
  word0 |= ((msg->cm_hdr.ch_dlc & 0xF) << 16);

  /* Word 1: Message marker and event FIFO control
   * Bits [31:24]: Message Marker
   * Bit [23]: Event FIFO Control
   * Other bits reserved
   */
  word1 = 0;  /* No marker, no event FIFO */

  /* Write to TX buffer */
  tx_buffer[0] = word0;
  tx_buffer[1] = word1;

  /* Write data bytes (words 2-3 for 8 bytes) */
  if (!msg->cm_hdr.ch_rtr && msg->cm_hdr.ch_dlc > 0)
    {
      /* Copy data bytes, handling endianness */
      tx_buffer[2] = ((uint32_t)msg->cm_data[0] << 0)  |
                     ((uint32_t)msg->cm_data[1] << 8)  |
                     ((uint32_t)msg->cm_data[2] << 16) |
                     ((uint32_t)msg->cm_data[3] << 24);

      if (msg->cm_hdr.ch_dlc > 4)
        {
          tx_buffer[3] = ((uint32_t)msg->cm_data[4] << 0)  |
                         ((uint32_t)msg->cm_data[5] << 8)  |
                         ((uint32_t)msg->cm_data[6] << 16) |
                         ((uint32_t)msg->cm_data[7] << 24);
        }
      else
        {
          tx_buffer[3] = 0;
        }
    }
  else
    {
      tx_buffer[2] = 0;
      tx_buffer[3] = 0;
    }

  /* ARM memory barrier to ensure TX buffer writes complete before triggering */
  //ARM_DMB();

  /* Trigger transmission by setting the corresponding bit in TXBAR */
  uint32_t txbar_value = (1 << put_index);
  putreg32(txbar_value, priv->base + STM32_FDCAN_TXBAR_OFFSET);

  /* Check protocol status for errors */
  static uint32_t tx_count = 0;
  tx_count++;
  if ((tx_count % 10) == 0)
    {
      uint32_t psr = getreg32(priv->base + STM32_FDCAN_PSR_OFFSET);
      uint32_t ecr = getreg32(priv->base + STM32_FDCAN_ECR_OFFSET);
      uint32_t rxf0s = getreg32(priv->base + STM32_FDCAN_RXF0S_OFFSET);
      uint32_t ir = getreg32(priv->base + STM32_FDCAN_IR_OFFSET);
      uint32_t ie = getreg32(priv->base + STM32_FDCAN_IE_OFFSET);

      printf("FDCAN%d: PSR=0x%08lX (LEC=%lu, BO=%lu, EP=%lu) ECR=0x%08lX (TEC=%lu, REC=%lu)\n",
             priv->port, psr, (unsigned long)((psr >> 0) & 0x7), (unsigned long)(!!(psr & (1<<7))), (unsigned long)(!!(psr & (1<<5))),
             ecr, (unsigned long)((ecr >> 0) & 0xFF), (unsigned long)((ecr >> 8) & 0x7F));
      printf("FDCAN%d: RXF0S=0x%08lX (fill=%lu, get=%lu) IR=0x%08lX IE=0x%08lX\n",
             priv->port, rxf0s, rxf0s & 0x7F, (rxf0s >> 8) & 0x3F, ir, ie);
    }

  leave_critical_section(flags);

  //stm32_fdcan_dump_registers(priv, "After Send");
  caninfo("FDCAN%d: Message queued for transmission\n", priv->port);
  printf("FDCAN%d: TX ID=0x%03X DLC=%d Data: %02X %02X %02X %02X %02X %02X %02X %02X (word0=0x%08lX word1=0x%08lX)\n",
         priv->port, msg->cm_hdr.ch_id, msg->cm_hdr.ch_dlc,
         msg->cm_data[0], msg->cm_data[1], msg->cm_data[2], msg->cm_data[3],
         msg->cm_data[4], msg->cm_data[5], msg->cm_data[6], msg->cm_data[7],
         word0, word1);
  return OK;
}

/****************************************************************************
 * Name: stm32_fdcan_txready
 *
 * Description:
 *   Return true if the TX hardware is ready to send another message.
 *
 ****************************************************************************/

static bool stm32_fdcan_txready(struct can_dev_s *dev)
{
  struct stm32_fdcan_s *priv = (struct stm32_fdcan_s *)dev->cd_priv;
  uint32_t txfqs;

  /* Read TX FIFO Queue Status register */
  txfqs = getreg32(priv->base + STM32_FDCAN_TXFQS_OFFSET);

  /* Check if FIFO is full */
  if ((txfqs & FDCAN_TXFQS_TFQF) != 0)
    {
      return false;  /* FIFO is full */
    }

  /* Check free level */
  uint32_t free_level = (txfqs & FDCAN_TXFQS_TFFL_MASK) >> FDCAN_TXFQS_TFFL_SHIFT;

  return (free_level > 0);
}

/****************************************************************************
 * Name: stm32_fdcan_txempty
 *
 * Description:
 *   Return true if all messages have been sent.  If for example, the CAN
 *   hardware implements FIFOs, then this would mean the transmit FIFO is
 *   empty.
 *
 ****************************************************************************/

static bool stm32_fdcan_txempty(struct can_dev_s *dev)
{
  struct stm32_fdcan_s *priv = (struct stm32_fdcan_s *)dev->cd_priv;
  uint32_t txfqs;

