PX4/NuttX/arch/arm/src/stm32h7/stm32_fdcan_cdev.c
  /* Read TX FIFO/Queue Status register */
  txfqs = getreg32(priv->base + STM32_FDCAN_TXFQS_OFFSET);

  /* Check free level - if it equals TX FIFO size (32), then FIFO is empty */
  uint32_t free_level = (txfqs & FDCAN_TXFQS_TFFL_MASK) >> FDCAN_TXFQS_TFFL_SHIFT;

  return (free_level == 32);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_caninitialize
 *
 * Description:
 *   Initialize the selected FDCAN port as a character device
 *
 * Input Parameters:
 *   port - CAN port number (1, 2, or 3)
 *
 * Returned Value:
 *   Valid CAN device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct can_dev_s *stm32_caninitialize(int port)
{
	//printf("stm32_caninitialize called with port %d\n", port);
  struct can_dev_s *dev = NULL;
  struct stm32_fdcan_s *priv = NULL;

  caninfo("FDCAN%d: Initializing\n", port);

  /* Select the requested CAN device */

#ifdef CONFIG_STM32H7_CAN1
  if (port == 1)
    {
      dev = &g_fdcan1dev;
      priv = &g_fdcan1priv;
    }
#endif

#ifdef CONFIG_STM32H7_CAN2
  if (port == 2)
    {
      dev = &g_fdcan2dev;
      priv = &g_fdcan2priv;
    }
#endif

  if (dev == NULL)
    {
      canerr("ERROR: Unsupported port %d\n", port);
      return NULL;
    }

  /* Initialize the device structure */

  priv->port = port;

  /* Calculate message RAM offsets
   * Each FDCAN interface gets 1280 words (5120 bytes) of the total
   * 2560 words (10240 bytes) available message RAM
   *
   * Layout per interface:
   * - Standard ID filters: 128 words (offset 0 for FDCAN1, 1280 for FDCAN2)
   * - Rx FIFO 0: 256 words (64 elements × 4 words)
   * - Tx FIFO: 256 words (64 elements × 4 words)
   */

  priv->rxmsgram_offset = (port - 1) * 1280;
  priv->txmsgram_offset = priv->rxmsgram_offset + 128 + 256;  /* After filters + RX FIFO */

  caninfo("FDCAN%d: Device structure initialized\n", port);
  caninfo("  Base: 0x%08lx\n", priv->base);
  caninfo("  Baud: %lu\n", priv->baud);
  caninfo("  RX RAM offset: %lu words\n", priv->rxmsgram_offset);
  caninfo("  TX RAM offset: %lu words\n", priv->txmsgram_offset);

  return dev;
}

/****************************************************************************
 * Name: stm32_fdcan_loopback
 *
 * Description:
 *   Enable or disable internal loopback mode for testing.
 *   In loopback mode, transmitted messages are internally routed to RX
 *   without going to the physical bus. This allows testing without external
 *   CAN devices.
 *
 * Input Parameters:
 *   port   - The FDCAN port number (1 or 2)
 *   enable - true to enable loopback, false to disable
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

int stm32_fdcan_loopback(int port, bool enable)
{
  struct stm32_fdcan_s *priv = NULL;
  irqstate_t flags;
  uint32_t cccr;

#ifdef CONFIG_STM32H7_CAN1
  if (port == 1)
    {
      priv = &g_fdcan1priv;
    }
#endif

#ifdef CONFIG_STM32H7_CAN2
  if (port == 2)
    {
      priv = &g_fdcan2priv;
    }
#endif

  if (priv == NULL)
    {
      canerr("ERROR: Invalid port %d\n", port);
      return -EINVAL;
    }

  caninfo("FDCAN%d: %s loopback mode\n", priv->port, enable ? "Enabling" : "Disabling");

  flags = enter_critical_section();

  /* Must be in INIT mode to change TEST.LBCK */
  cccr = getreg32(priv->base + STM32_FDCAN_CCCR_OFFSET);
  if (!(cccr & FDCAN_CCCR_INIT))
    {
      /* Enter INIT mode */
      modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, 0, FDCAN_CCCR_INIT);

      /* Wait for INIT mode */
      int timeout = 1000;
      while (!(getreg32(priv->base + STM32_FDCAN_CCCR_OFFSET) & FDCAN_CCCR_INIT) && timeout-- > 0)
        {
          up_udelay(10);
        }

      if (timeout <= 0)
        {
          canerr("Failed to enter INIT mode for loopback configuration\n");
          leave_critical_section(flags);
          return -ETIMEDOUT;
        }
    }

  /* Enable CCE to allow configuration */
  modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, 0, FDCAN_CCCR_CCE);

  /* Set TEST mode bit to access TEST register */
  if (enable)
    {
      modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, 0, FDCAN_CCCR_TEST);

      /* Enable loopback mode in TEST register */
      modifyreg32(priv->base + STM32_FDCAN_TEST_OFFSET, 0, FDCAN_TEST_LBCK);

      /* DON'T enable MON - try loopback without bus monitoring to get data storage */
      /* modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, 0, FDCAN_CCCR_MON); */
      caninfo("FDCAN%d: Loopback enabled WITHOUT MON mode\n", priv->port);
    }
  else
    {
      /* Disable loopback mode */
      modifyreg32(priv->base + STM32_FDCAN_TEST_OFFSET, FDCAN_TEST_LBCK, 0);

      /* Disable MON and TEST modes */
      modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET,
                  FDCAN_CCCR_TEST | FDCAN_CCCR_MON, 0);
    }

  /* Disable CCE */
  modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, FDCAN_CCCR_CCE, 0);

  /* Exit INIT mode to resume operation */
  modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, FDCAN_CCCR_INIT, 0);

  /* Wait for normal mode */
  int timeout = 1000;
  while ((getreg32(priv->base + STM32_FDCAN_CCCR_OFFSET) & FDCAN_CCCR_INIT) && timeout-- > 0)
    {
      up_udelay(10);
    }

  if (timeout <= 0)
    {
      canerr("Failed to exit INIT mode after loopback configuration\n");
      leave_critical_section(flags);
      return -ETIMEDOUT;
    }

  leave_critical_section(flags);

  uint32_t test = getreg32(priv->base + STM32_FDCAN_TEST_OFFSET);
  uint32_t cccr_final = getreg32(priv->base + STM32_FDCAN_CCCR_OFFSET);

  caninfo("FDCAN%d: Loopback mode %s - TEST=0x%08lx CCCR=0x%08lx (LBCK=%d MON=%d)\n",
          priv->port, enable ? "enabled" : "disabled", test, cccr_final,
          !!(test & FDCAN_TEST_LBCK), !!(cccr_final & FDCAN_CCCR_MON));

  return OK;
}

#endif /* CONFIG_CAN && (CONFIG_STM32H7_CAN1 || CONFIG_STM32H7_CAN2 || CONFIG_STM32H7_CAN3) */
